[{"Id":"fX_yRRn8RIIC","Title":"JavaScript. Освой на примерах","Authors":["Вахтуров Виктор Викторович"],"PublishedDate":"2007","Description":"На наглядных примерах даны практические приемы программирования клиентских сценариев для Web браузеров. Кратко изложены основы создания Web страниц и скриптов: язык JavaScript, каскадные таблицы стилей (CSS) и объектная модель документа (DOM). Рассмотрено решение типовых задач программирования скриптов: работа с датой и временем, cookies, регулярными выражениями и протоколами. Даны примеры соз-дания динамических эффектов: управление окном браузера, разработка динамических форм, средства и способы работы с изображениями, анимационные эффекты, реализация перетаскивания (Drag and Drop), эмуляция элементов управления пользовательского интерфейса. Рассмотрено написание функционально законченных приложений: реализация визуального редактора HTML и нескольких известных игр на JavaScript. Исходные тексты всех примеров находятся на прилагаемом компакт диске. Файлы для книги можно скачать по ссылке ftp://ftp.bhv.ru/9785941578771.zip","PageCount":400,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=fX_yRRn8RIIC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=fX_yRRn8RIIC\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"},{"Id":"9RTiAAAAQBAJ","Title":"Самоучитель JavaScript","Authors":["Дмитриева Марина Валерьевна"],"PublishedDate":"2001","Description":"Книга рассчитана на тех пользователей, которые не знакомы с программированием, но хотят ему обучиться. С помощью данного издания читатель сможет научиться создавать Web-приложения, формировать документы в форме Web-сайта, к примеру, для того чтоб в дальнейшем опубликовать их в Интернете. Здесь приводится рассмотрение способов представления информации в форме таблицы при помощи окон, флеймов и слоёв. Также имеются средства для организации взаимодействия между документами, создания сайта с подходящей системой навигации по страницам сайта и по отдельно взятой странице. Книга содержит в себе множество примеров проектирования и графических, и текстовых меню разной степени вложенности, приводятся примеры применения и проектирования иллюстративного материала, в том числе и построение диаграмм. Сценарии, которые реализуют визуальные эффекты и используют разные средства языка, рассматриваются в разных главах, из них пользователь сможет выбрать подходящую своим запросам технологию.","PageCount":507,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=9RTiAAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=9RTiAAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"},{"Id":"OGNXlc_A8kgC","Title":"Сценарии для Web-сайта: PHP и JavaScript, 2 изд.","Authors":["Дунаев Вадим Вячеславович"],"PublishedDate":"2012","Description":"Книга посвящена использованию языков JavaScript и PHP для разработки Web-приложений. Приведены основные понятия, связанные с разработкой Web-сайта, а также сведения о языке HTML и каскадных таблицах стилей (CSS). Рассмотрены основы программирования на JavaScript и PHP 5. Приведены практические примеры различных клиентских и серверных сценариев. Описаны особенности и даны рекомендации по применению этих языков. В приложениях содержатся сведения по объектам документа и браузера, с которыми работают клиентские сценарии, а также рассказывается о том, как установить и настроить PHP и Web-сервер IIS в системе Windows. Во втором издании добавлены новые примеры.","PageCount":576,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=OGNXlc_A8kgC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=OGNXlc_A8kgC\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"},{"Id":"vuJWYAVWDJQC","Title":"JavaScript. Народные советы","Authors":["Дронов Владимир Александрович"],"PublishedDate":"2012","Description":"Книга представляет собой подборку решений, зачастую неочевидных, типичных проблем Web рограммирования, приемов, советов и готовых Web сенариев. Рассмотрены следующие темы: полезные функции и объекты языка JavaScript, написание сценариев и обработка событий, получение сведений о Web обозревателе и управление им, манипуляции и эффекты с Web страницами и их элементами, работа с графикой, гиперссылками и полосами навигации, вывод информации о таблицах, эффекты с фреймами, управление свободно позиционируемыми контейнерами, создание мультимедийных элементов и управление ими, простейший ввод вывод, сохранение и передача данных, работа с формами и элементами управления, простейшие и более сложные приемы Web программирования, отладка Web приложений и др.","PageCount":464,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=vuJWYAVWDJQC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=vuJWYAVWDJQC\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"},{"Id":"FSVTDwAAQBAJ","Title":"Eloquent JavaScript, 3rd Edition","Authors":["Marijn Haverbeke"],"PublishedDate":"2018-12-04","Description":"Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications. JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. This much anticipated and thoroughly revised third edition of Eloquent JavaScript dives deep into the JavaScript language to show you how to write beautiful, effective code. It has been updated to reflect the current state of Java¬Script and web browsers and includes brand-new material on features like class notation, arrow functions, iterators, async functions, template strings, and block scope. A host of new exercises have also been added to test your skills and keep you on track. As with previous editions, Haverbeke continues to teach through extensive examples and immerses you in code from the start, while exercises and full-chapter projects give you hands-on experience with writing your own programs. You start by learning the basic structure of the JavaScript language as well as control structures, functions, and data structures to help you write basic programs. Then you\u0027ll learn about error handling and bug fixing, modularity, and asynchronous programming before moving on to web browsers and how JavaScript is used to program them. As you build projects such as an artificial life simulation, a simple programming language, and a paint program, you\u0027ll learn how to: - Understand the essential elements of programming, including syntax, control, and data - Organize and clarify your code with object-oriented and functional programming techniques - Script the browser and make basic web applications - Use the DOM effectively to interact with browsers - Harness Node.js to build servers and utilities Isn\u0027t it time you became fluent in the language of the Web? * All source code is available online in an inter¬active sandbox, where you can edit the code, run it, and see its output instantly.","PageCount":472,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=FSVTDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=FSVTDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"en"},{"Id":"9EK6AgAAQBAJ","Title":"JavaScript в Web-дизайне","Authors":["Дронов Владимир Александрович"],"PublishedDate":"2005","Description":"Книга посвящена языку сценариев JavaScript и его использованию в Web-дизайне. Дан вводный курс по языку HTML. Рассматривается работа JavaScript-сценариев в составе Web-страниц: общие принципы написания сценариев; управление элементами страниц на основе объектной модели документа (DOM); организация взаимодействия с пользователем на основе событий; ввод-вывод при помощи Web-форм, диалоговых HTML-окон, Буфера обмена и технологии drag-n-drop; работа с базами данных; применение мультимедийных эффектов. Изложение сопровождается большим количеством примеров HTML-страниц с использованием JavaScript-сценариев. В приложениях к книге содержатся справочные сведения о HTML, CSS и DOM.","PageCount":871,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=9EK6AgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=9EK6AgAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"},{"Id":"yK6tDwAAQBAJ","Title":"Выразительный JavaScript. Современное веб-программирование. 3-е издание","Authors":["Хавербеке Марейн"],"PublishedDate":"2019-06-13","Description":"«Выразительный JavaScript» позволит глубоко погрузиться в тему, научиться писать красивый и эффективный код. Вы познакомитесь с синтаксисом, стрелочными и асинхронными функциями, итератором, шаблонными строками и блочной областью видимости. Марейн Хавербеке – практик. Получайте опыт и изучайте язык на множестве примеров, выполняя упражнения и учебные проекты. Сначала вы познакомитесь со структурой языка JavaScript, управляющими структурами, функциями и структурами данных, затем изучите обработку ошибок и исправление багов, модульность и асинхронное программирование, после чего перейдете к программированию браузеров.","PageCount":480,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=yK6tDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=yK6tDwAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"},{"Id":"2weL0iAfrEMC","Title":"JavaScript: The Definitive Guide","Authors":["David Flanagan"],"PublishedDate":"2006-08-17","Description":"This Fifth Edition is completely revised and expanded to cover JavaScript as it is used in today\u0027s Web 2.0 applications. This book is both an example-driven programmer\u0027s guide and a keep-on-your-desk reference, with new chapters that explain everything you need to know to get the most out of JavaScript, including: Scripted HTTP and Ajax XML processing Client-side graphics using the canvas tag Namespaces in JavaScript--essential when writing complex programs Classes, closures, persistence, Flash, and JavaScript embedded in Java applications Part I explains the core JavaScript language in detail. If you are new to JavaScript, it will teach you the language. If you are already a JavaScript programmer, Part I will sharpen your skills and deepen your understanding of the language. Part II explains the scripting environment provided by web browsers, with a focus on DOM scripting with unobtrusive JavaScript. The broad and deep coverage of client-side JavaScript is illustrated with many sophisticated examples that demonstrate how to: Generate a table of contents for an HTML document Display DHTML animations Automate form validation Draw dynamic pie charts Make HTML elements draggable Define keyboard shortcuts for web applications Create Ajax-enabled tool tips Use XPath and XSLT on XML documents loaded with Ajax And much more Part III is a complete reference for core JavaScript. It documents every class, object, constructor, method, function, property, and constant defined by JavaScript 1.5 and ECMAScript Version 3. Part IV is a reference for client-side JavaScript, covering legacy web browser APIs, the standard Level 2 DOM API, and emerging standards such as the XMLHttpRequest object and the canvas tag. More than 300,000 JavaScript programmers around the world have madethis their indispensable reference book for building JavaScript applications. \u0022A must-have reference for expert JavaScript programmers...well-organized and detailed.\u0022 -- Brendan Eich, creator of JavaScript","PageCount":1022,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=2weL0iAfrEMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=2weL0iAfrEMC\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"en"},{"Id":"Co61EAAAQBAJ","Title":"JavaScript All-in-One For Dummies","Authors":["Chris Minnick"],"PublishedDate":"2023-05-09","Description":"A developer’s resource to learning one of the most-used scripting languages JavaScript All-in-One For Dummies saves you shelf space by offering a complete introduction to JavaScript and how it’s used in the real world. This book serves up JavaScript coding basics before diving into the tools, libraries, frameworks, and runtime environments new and experienced coders need to know. Start by learning the basics of JavaScript and progress through the techniques and tools used by professional JavaScript developers, even if you’ve never written code before. You also get the details of today’s hottest libraries and frameworks—React.js, Vue.js, Svelte, and Node.js. Learn the basics of web and application development with the JavaScript language Grasp the similarities and differences between React.js, Vue.js, and Svelte Discover how to write server-side JavaScript and how to access databases with Node.js Gain a highly marketable skill, with one of the most popular coding languages Launch or further your career as a coder with easy-to-follow instruction This is the go-to Dummies guide for future and current coders who need an all-inclusive guide JavaScript. This is the go-to Dummies guide for future and current coders who need an all-inclusive guide to the world of JavaScript.","PageCount":823,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=Co61EAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=Co61EAAAQBAJ\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"en"},{"Id":"vnvzExcJnpMC","Title":"Самоучитель JavaScript. 3-е изд.","Authors":["Дунаев Вадим Вячеславович"],"PublishedDate":"2008-07-02","Description":"Книга предназначена для самостоятельного освоения программирования на языке JavaScript. Это издание — не справочник, а практическое руководство для самостоятельного изучения JavaScript, не требующее от читателя предварительной подготовки в области программирования. Кроме общего руководства книга содержит множество примеров и текстов готовых к использованию программ. Рассматриваются вопросы создания сценариев для веб-сайтов, а также сценариев, выполняемых Windows Scripting Host. В приложениях приводится справочная информация по JavaScript и HTML. Книга адресована как новичкам, так и тем, кто уже имеет некоторый опыт в веб-дизайне и программировании.","PageCount":400,"Categories":["Computers"],"ImageLinks":{"Thumbnail":"http://books.google.com/books/content?id=vnvzExcJnpMC\u0026printsec=frontcover\u0026img=1\u0026zoom=1\u0026edge=curl\u0026source=gbs_api","SmallThumbnail":"http://books.google.com/books/content?id=vnvzExcJnpMC\u0026printsec=frontcover\u0026img=1\u0026zoom=5\u0026edge=curl\u0026source=gbs_api"},"Language":"ru"}]